function setup() {
  createCanvas(600, 400);
  //낮하늘 배경//
  noStroke()
  fill(180, 220, 255);
  rect(0, 0, 300, 400);
  //밤하늘 배경//
  fill(25, 10, 100);
  rect(300, 0, 300, 400);
  //땅 배경//
  fill(100, 70, 40);
  rect(0, 350, 300, 50);
  fill(70, 40, 20);
  rect(300, 0, 300, 50);
}
function  draw() {
  //낮:해//
  noStroke();
  fill(255, 204, 204);
  arc(0, 0, 600, 600, 0, radians(90) );
  fill(255, 153, 153);
  arc(0, 0, 400, 400, 0, radians(90) );
  fill(255, 102, 102);
  arc(0, 0, 250, 250, 0, radians(90) );
  fill(255, 0, 0);
  arc(0, 0, 100, 100, 0, radians(90) );
  //밤:달//
  noStroke();
  fill(100, 100, 20);
  circle(600, 400, 600 );
  fill(150, 150, 50);
  circle(600, 400, 400 );
  fill(200, 200, 20);
  circle(600, 400, 250 );
  fill(255, 255, 0);
  circle(600, 400, 100 );
  //낮-집//
  stroke(0, 128, 0);
  fill(34, 139, 34);
  triangle(150, 100, 50, 200, 250, 200)
  fill(144, 238, 144);
  quad(80, 200, 220, 200, 220, 350, 80, 350 );
  stroke(0, 0, 255);
  strokeWeight(3);
  fill(70, 110, 220);
  square(125, 140, 50);
  strokeWeight(3);
  fill(0, 0, 255);
  line(150, 140, 150, 190);
  line(125, 165, 175, 165);
  stroke(255, 180, 0)
  fill(255, 255, 0);
  quad(110, 220, 190, 220, 190, 330, 110, 330 );
  fill(255, 200, 0);
  ellipse(130, 275, 20);
  noStroke();
  fill(255, 220, 235);
  quad(80, 350, 220, 350, 240, 400, 60, 400);
  //밤-집//
  stroke(20, 80, 40);
  fill(50, 100, 60);
  triangle(450, 300, 350, 200, 550, 200)
  fill(110, 160, 110);
  quad(380, 50, 520, 50, 520, 200, 380, 200 );
  stroke(40, 50, 120);
  strokeWeight(3);
  fill(40, 60, 160);
  square(425, 210, 50);
  strokeWeight(3);
  fill(30, 50, 100);
  line(425, 235, 475, 235);
  line(450, 210, 450, 260);
  stroke(160, 150, 90)
  fill(240, 220, 60);
  quad(410, 70, 490, 70, 490, 180, 410, 180);
  stroke(160, 150, 90);
  fill(180, 160, 70);
  ellipse(430, 125, 20);
  noStroke();
  fill(200, 160, 170);
  quad(380, 50, 520, 50, 540, 0, 360, 0);
  //시계//
  noStroke();
  fill(50, 50, 70);
  circle(300, 200, 140);
  fill(230, 230, 220);
  circle(300, 200, 110);
  //중심 점//
  fill(80, 80, 80);
  circle(300, 200, 10);
  //시계 바늘//
  stroke(80);
  strokeWeight(4);
  line(300, 200, 300, 160);
  line(300, 200, 340, 200);
}